In [2]:
import pandas as pd
import numpy as np

### Question 1
You will be supplied with two data files in CSV format . The first file contains statistics about various dinosaurs. The second file contains additional data. Given the following formula, speed = ((STRIDE_LENGTH / LEG_LENGTH) - 1) * SQRT(LEG_LENGTH * g) Where g = 9.8 m/s^2 (gravitational constant)

Write a program to read in the data files from disk, it must then print the names of only the bipedal dinosaurs from fastest to slowest. Do not print any other information.


`$ cat dataset1.csv NAME,LEG_LENGTH,DIET Hadrosaurus,1.4,herbivore Struthiomimus,0.72,omnivore Velociraptor,1.8,carnivore Triceratops,0.47,herbivore Euoplocephalus,2.6,herbivore Stegosaurus,1.50,herbivore Tyrannosaurus Rex,6.5,carnivore`

`$ cat dataset2.csv NAME,STRIDE_LENGTH,STANCE Euoplocephalus,1.97,quadrupedal Stegosaurus,1.70,quadrupedal Tyrannosaurus Rex,4.76,bipedal Hadrosaurus,1.3,bipedal Deinonychus,1.11,bipedal Struthiomimus,1.24,bipedal Velociraptorr,2.62,bipedal`

In [3]:
df = pd.DataFrame

In [4]:
ls

2009/
2010/
2011/
2014/
dinos new.ipynb
dinos summarized solution in pandas.ipynb
dinos workbook.ipynb
dinosaurs1.csv
dinosaurs2.csv
fb_problem
homework/
homework.tar.gz
moby_dick.txt
speed_calc.py

In [9]:
temp1 = pd.read_csv('dinosaurs1.csv')
temp2 = pd.read_csv('dinosaurs2.csv')

In [10]:
temp1

      NAME   LENGTH       FOOD
0    alice        3       soda
1      bob        5     burger
2  charlie        2      pizza
3    david        6   sandwich
4      eve        4       taco
5    frank        6       taco
6   george       11      pizza

In [11]:
temp2

      NAME   STRIDE    COLOR
0    alice        3     blue
1      bob        4     blue
2  charlie        2   yellow
3    david        6      red
4      eve        5     blue
5    frank        6     blue
6   george       11     blue

In [15]:
df = temp1.merge(temp2,on='NAME').copy()

In [16]:
df

      NAME   LENGTH       FOOD   STRIDE    COLOR
0    alice        3       soda        3     blue
1      bob        5     burger        4     blue
2  charlie        2      pizza        2   yellow
3    david        6   sandwich        6      red
4      eve        4       taco        5     blue
5    frank        6       taco        6     blue
6   george       11      pizza       11     blue

In [33]:
df.columns

Index(['NAME', 'LENGTH', ' FOOD', ' STRIDE', ' COLOR'], dtype='object')

In [36]:
df.rename(columns={" LENGTH":"LENGTH"},inplace=True)
df.rename(columns={" STRIDE":"STRIDE"},inplace=True)
df.columns

Index(['NAME', 'LENGTH', ' FOOD', 'STRIDE', ' COLOR'], dtype='object')

In [37]:
df.LENGTH + df.STRIDE

0     6
1     9
2     4
3    12
4     9
5    12
6    22
dtype: int64

In [38]:
df['speed'] = df.LENGTH + df.STRIDE

In [39]:
df

      NAME  LENGTH       FOOD  STRIDE    COLOR  speed
0    alice       3       soda       3     blue      6
1      bob       5     burger       4     blue      9
2  charlie       2      pizza       2   yellow      4
3    david       6   sandwich       6      red     12
4      eve       4       taco       5     blue      9
5    frank       6       taco       6     blue     12
6   george      11      pizza      11     blue     22

In [42]:
df.sort_values('speed', ascending=False)

      NAME  LENGTH       FOOD  STRIDE    COLOR  speed
6   george      11      pizza      11     blue     22
3    david       6   sandwich       6      red     12
5    frank       6       taco       6     blue     12
1      bob       5     burger       4     blue      9
4      eve       4       taco       5     blue      9
0    alice       3       soda       3     blue      6
2  charlie       2      pizza       2   yellow      4

In [46]:
df['speed'].max()

22

In [47]:
df10 = pd.DataFrame

In [48]:
d1,d2 = pd.read_csv('dataset1.csv'),pd.read_csv('dataset2.csv')

In [49]:
d1, d2

(                NAME  LEG_LENGTH       DIET
 0        Hadrosaurus        1.40  herbivore
 1      Struthiomimus        0.72   omnivore
 2       Velociraptor        1.80  carnivore
 3        Triceratops        0.47  herbivore
 4     Euoplocephalus        2.60  herbivore
 5        Stegosaurus        1.50  herbivore
 6  Tyrannosaurus Rex        6.50  carnivore,
                 NAME  STRIDE_LENGTH       STANCE
 0     Euoplocephalus           1.97  quadrupedal
 1        Stegosaurus           1.70  quadrupedal
 2  Tyrannosaurus Rex           4.76      bipedal
 3        Hadrosaurus           1.30      bipedal
 4        Deinonychus           1.11      bipedal
 5      Struthiomimus           1.24      bipedal
 6      Velociraptorr           2.62      bipedal)

speed = ((STRIDE_LENGTH / LEG_LENGTH) - 1) * SQRT(LEG_LENGTH * g) Where g = 9.8 m/s^2 (gravitational constant)

In [51]:
df10 = d1.merge(d2,on='NAME').copy()

In [52]:
df10

                NAME  LEG_LENGTH       DIET  STRIDE_LENGTH       STANCE
0        Hadrosaurus        1.40  herbivore           1.30      bipedal
1      Struthiomimus        0.72   omnivore           1.24      bipedal
2     Euoplocephalus        2.60  herbivore           1.97  quadrupedal
3        Stegosaurus        1.50  herbivore           1.70  quadrupedal
4  Tyrannosaurus Rex        6.50  carnivore           4.76      bipedal

In [150]:
g=9.8
df10['speed'] = (df10.STRIDE_LENGTH / df10.LEG_LENGTH) * np.sqrt(df10['LEG_LENGTH'] * g)

In [151]:
df10.sort_values('speed',ascending=False)

,NAME,LEG_LENGTH,DIET,STRIDE_LENGTH,STANCE,speed
4,Tyrannosaurus Rex,6.50,carnivore,4.76,bipedal,5.844715
1,Struthiomimus,0.72,omnivore,1.24,bipedal,4.574762
3,Stegosaurus,1.50,herbivore,1.70,quadrupedal,4.345266
2,Euoplocephalus,2.60,herbivore,1.97,quadrupedal,3.824658
0,Hadrosaurus,1.40,herbivore,1.30,bipedal,3.439477

In [152]:
df10[df10['STANCE'] == 'bipedal'].sort_values('speed',ascending=False)['NAME']

4    Tyrannosaurus Rex
1        Struthiomimus
0          Hadrosaurus
Name: NAME, dtype: object

### Question 2:
Given an array of integers greater than zero, find if it is possible to split it in two subarrays (without reordering the elements), such that the sum of the two subarrays is the same. Print the two subarrays.

I calculated rightSum initially by using sum(nums), then looped over nums, and added nums[i] to leftSum, and subtracted it from rightSum, then checked if there was a match and printed that.

In [59]:
import random

In [60]:
myarr = [random.randint(1,4096) for x in range(10)]

In [61]:
myarr

[329, 625, 3481, 2143, 1034, 2190, 3080, 344, 155, 1093]

In [66]:
m = int(len(myarr)/2)

In [68]:
left = myarr[:m]
right = myarr[m:]

In [69]:
sum(left) == sum(right)

False

In [136]:
def splitArraysSame(arr):
    """
    This only covers the case for an even split of the elements
    """
    m = int(len(arr)/2)
    left = arr[:m]
    right = arr[m:]
    return sum(left) == sum(right)

In [78]:
# an array of length 10 can split into how many comparatives?
# 1/9, 2/8, 3/7, 4/6, 5/5, 6/4, 7/3, 8/2, 9/1 - 9 total combinations
# loop through - compare x + loop?
for x in range(0,len(myarr) -1):
    print(sum(myarr[:x]) == sum(myarr[x:]))

False
False
False
False
False
False
False
False
False

In [82]:
# split down the middle method should work
myarr2 = [1,2,3,4,5,5,4,3,2,1]
len(myarr2)

10

In [101]:
sum(myarr2[:5]) == sum(myarr2[5:])

True

In [96]:
# :2 == 2:
myarr3 = [5,5,1,1,1,1,1,1,2,2]
len(myarr3)

10

In [100]:
sum(myarr3[:2]) == sum(myarr3[2:])

True

In [140]:
splitArraysSame(myarr2)

True

In [102]:
# loop through - compare x + loop?
for x in range(0,len(myarr2) -1):
    print(sum(myarr2[:x]) == sum(myarr2[x:]))

False
False
False
False
False
True
False
False
False

In [103]:
# loop through - compare x + loop?
for x in range(0,len(myarr3) -1):
    print(sum(myarr3[:x]) == sum(myarr3[x:]))

False
False
True
False
False
False
False
False
False

In [109]:
def iterateArraySame(arr):
    """
    This works. Can I turn it into a lambda?
    """
    p=0
    for x in range(0,len(arr) -1):
        if sum(arr[:x]) == sum(arr[x:]):
            p+=1
    if p>0:
        return True
    else:
        return False

In [113]:
iterateArraySame(myarr3)

True

In [141]:
def lambdaArraySame(arr):
    xx=[]
    xx.append(lambda x: sum(arr[:x]) == sum(arr[x:]) for x in range(0,len(arr) -1))
    return xx

In [143]:
lambdaArraySame(myarr2)

[<generator object lambdaArraySame.<locals>.<genexpr> at 0x119ec0dd0>]